"The name of your computer " = "Il nome del tuo computer ";
"This computer’s local hostname " = "Il nome host locale di questo computer ";
"“" = "“";
"”" = "”";
" is already in use on this network. " = " è già in uso su questo network. ";
"The name has been changed to " = "Il nome è stato cambiato in ";
"." = ".";

"To change the name of your computer, open System Preferences and click Sharing, then type the name in the Computer Name field." = "Per modificare il nome del computer, apri Preferenze di sistema e fai clic su Condivisione, quindi inserisci il nome nel campo Nome computer.";
"To change the local hostname, open System Preferences and click Sharing, then click “Edit” and type the name in the Local Hostname field." = "Per modificare il nome host locale, apri Preferenze di sistema e fai clic su Condivisione. Quindi fai clic su Modifica e inserisci il nome nel campo Nome host locale.";

"All attempts to find an available name by adding a number to the name were also unsuccessful." = "Tutti i tentativi di trovare un nome disponibile aggiungendo un numero al nome sono falliti.";
"This may indicate a problem with the local network. Please inform your network administrator." = "Potrebbe rappresentare un problema con il network locale: informa l'amministratore del network.";
